----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 300, 300]          10,400
       BatchNorm2d-2         [-1, 32, 300, 300]              64
            Conv2d-3         [-1, 64, 150, 150]          32,832
       BatchNorm2d-4         [-1, 64, 150, 150]             128
            Conv2d-5          [-1, 128, 75, 75]         131,200
       BatchNorm2d-6          [-1, 128, 75, 75]             256
            Conv2d-7          [-1, 128, 75, 75]         147,584
       BatchNorm2d-8          [-1, 128, 75, 75]             256
            Conv2d-9          [-1, 128, 75, 75]         147,584
      BatchNorm2d-10          [-1, 128, 75, 75]             256
    ResidualBlock-11          [-1, 128, 75, 75]               0
           Conv2d-12           [-1, 64, 75, 75]           8,256
      BatchNorm2d-13           [-1, 64, 75, 75]             128
        ConvBlock-14           [-1, 64, 75, 75]               0
           Conv2d-15           [-1, 32, 75, 75]           4,128
      BatchNorm2d-16           [-1, 32, 75, 75]              64
        ConvBlock-17           [-1, 32, 75, 75]               0
           Conv2d-18           [-1, 32, 75, 75]           9,248
      BatchNorm2d-19           [-1, 32, 75, 75]              64
        ConvBlock-20           [-1, 32, 75, 75]               0
           Conv2d-21           [-1, 16, 75, 75]           2,064
      BatchNorm2d-22           [-1, 16, 75, 75]              32
        ConvBlock-23           [-1, 16, 75, 75]               0
           Conv2d-24           [-1, 16, 75, 75]           6,416
      BatchNorm2d-25           [-1, 16, 75, 75]              32
        ConvBlock-26           [-1, 16, 75, 75]               0
        MaxPool2d-27          [-1, 128, 75, 75]               0
           Conv2d-28           [-1, 16, 75, 75]           2,064
      BatchNorm2d-29           [-1, 16, 75, 75]              32
        ConvBlock-30           [-1, 16, 75, 75]               0
   InceptionBlock-31          [-1, 128, 75, 75]               0
           Conv2d-32          [-1, 128, 75, 75]         147,584
      BatchNorm2d-33          [-1, 128, 75, 75]             256
           Conv2d-34          [-1, 128, 75, 75]         147,584
      BatchNorm2d-35          [-1, 128, 75, 75]             256
    ResidualBlock-36          [-1, 128, 75, 75]               0
           Conv2d-37           [-1, 64, 75, 75]           8,256
      BatchNorm2d-38           [-1, 64, 75, 75]             128
        ConvBlock-39           [-1, 64, 75, 75]               0
           Conv2d-40           [-1, 32, 75, 75]           4,128
      BatchNorm2d-41           [-1, 32, 75, 75]              64
        ConvBlock-42           [-1, 32, 75, 75]               0
           Conv2d-43           [-1, 32, 75, 75]           9,248
      BatchNorm2d-44           [-1, 32, 75, 75]              64
        ConvBlock-45           [-1, 32, 75, 75]               0
           Conv2d-46           [-1, 16, 75, 75]           2,064
      BatchNorm2d-47           [-1, 16, 75, 75]              32
        ConvBlock-48           [-1, 16, 75, 75]               0
           Conv2d-49           [-1, 16, 75, 75]           6,416
      BatchNorm2d-50           [-1, 16, 75, 75]              32
        ConvBlock-51           [-1, 16, 75, 75]               0
        MaxPool2d-52          [-1, 128, 75, 75]               0
           Conv2d-53           [-1, 16, 75, 75]           2,064
      BatchNorm2d-54           [-1, 16, 75, 75]              32
        ConvBlock-55           [-1, 16, 75, 75]               0
   InceptionBlock-56          [-1, 128, 75, 75]               0
           Conv2d-57          [-1, 128, 75, 75]         147,584
      BatchNorm2d-58          [-1, 128, 75, 75]             256
           Conv2d-59          [-1, 128, 75, 75]         147,584
      BatchNorm2d-60          [-1, 128, 75, 75]             256
    ResidualBlock-61          [-1, 128, 75, 75]               0
  ConvTranspose2d-62         [-1, 64, 151, 151]         131,136
      BatchNorm2d-63         [-1, 64, 151, 151]             128
  ConvTranspose2d-64         [-1, 32, 301, 301]          32,800
      BatchNorm2d-65         [-1, 32, 301, 301]              64
  ConvTranspose2d-66         [-1, 32, 301, 301]          82,976
           Conv2d-67          [-1, 1, 300, 300]             129
           Conv2d-68          [-1, 1, 300, 300]             129
           Conv2d-69          [-1, 1, 300, 300]             129
           Conv2d-70          [-1, 1, 300, 300]             129
================================================================
Total params: 1,374,596
Trainable params: 1,374,596
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.37
Forward/backward pass size (MB): 317.96
Params size (MB): 5.24
Estimated Total Size (MB): 324.58
----------------------------------------------------------------
