----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7           [-1, 64, 56, 56]           8,256
       BatchNorm2d-8           [-1, 64, 56, 56]             128
         ConvBlock-9           [-1, 64, 56, 56]               0
           Conv2d-10           [-1, 32, 56, 56]           4,128
      BatchNorm2d-11           [-1, 32, 56, 56]              64
        ConvBlock-12           [-1, 32, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           9,248
      BatchNorm2d-14           [-1, 32, 56, 56]              64
        ConvBlock-15           [-1, 32, 56, 56]               0
           Conv2d-16           [-1, 16, 56, 56]           2,064
      BatchNorm2d-17           [-1, 16, 56, 56]              32
        ConvBlock-18           [-1, 16, 56, 56]               0
           Conv2d-19           [-1, 16, 56, 56]           6,416
      BatchNorm2d-20           [-1, 16, 56, 56]              32
        ConvBlock-21           [-1, 16, 56, 56]               0
        MaxPool2d-22          [-1, 128, 56, 56]               0
           Conv2d-23           [-1, 16, 56, 56]           2,064
      BatchNorm2d-24           [-1, 16, 56, 56]              32
        ConvBlock-25           [-1, 16, 56, 56]               0
      BatchNorm2d-26          [-1, 128, 56, 56]             256
   InceptionBlock-27          [-1, 128, 56, 56]               0
AdaptiveAvgPool2d-28            [-1, 128, 1, 1]               0
           Conv1d-29               [-1, 1, 128]               3
      BatchNorm2d-30          [-1, 128, 56, 56]             256
              ECA-31          [-1, 128, 56, 56]               0
           Conv2d-32           [-1, 64, 56, 56]           8,256
      BatchNorm2d-33           [-1, 64, 56, 56]             128
        ConvBlock-34           [-1, 64, 56, 56]               0
           Conv2d-35           [-1, 32, 56, 56]           4,128
      BatchNorm2d-36           [-1, 32, 56, 56]              64
        ConvBlock-37           [-1, 32, 56, 56]               0
           Conv2d-38           [-1, 32, 56, 56]           9,248
      BatchNorm2d-39           [-1, 32, 56, 56]              64
        ConvBlock-40           [-1, 32, 56, 56]               0
           Conv2d-41           [-1, 16, 56, 56]           2,064
      BatchNorm2d-42           [-1, 16, 56, 56]              32
        ConvBlock-43           [-1, 16, 56, 56]               0
           Conv2d-44           [-1, 16, 56, 56]           6,416
      BatchNorm2d-45           [-1, 16, 56, 56]              32
        ConvBlock-46           [-1, 16, 56, 56]               0
        MaxPool2d-47          [-1, 128, 56, 56]               0
           Conv2d-48           [-1, 16, 56, 56]           2,064
      BatchNorm2d-49           [-1, 16, 56, 56]              32
        ConvBlock-50           [-1, 16, 56, 56]               0
      BatchNorm2d-51          [-1, 128, 56, 56]             256
   InceptionBlock-52          [-1, 128, 56, 56]               0
           Conv2d-53           [-1, 64, 56, 56]           8,256
      BatchNorm2d-54           [-1, 64, 56, 56]             128
        ConvBlock-55           [-1, 64, 56, 56]               0
           Conv2d-56           [-1, 32, 56, 56]           4,128
      BatchNorm2d-57           [-1, 32, 56, 56]              64
        ConvBlock-58           [-1, 32, 56, 56]               0
           Conv2d-59           [-1, 32, 56, 56]           9,248
      BatchNorm2d-60           [-1, 32, 56, 56]              64
        ConvBlock-61           [-1, 32, 56, 56]               0
           Conv2d-62           [-1, 16, 56, 56]           2,064
      BatchNorm2d-63           [-1, 16, 56, 56]              32
        ConvBlock-64           [-1, 16, 56, 56]               0
           Conv2d-65           [-1, 16, 56, 56]           6,416
      BatchNorm2d-66           [-1, 16, 56, 56]              32
        ConvBlock-67           [-1, 16, 56, 56]               0
        MaxPool2d-68          [-1, 128, 56, 56]               0
           Conv2d-69           [-1, 16, 56, 56]           2,064
      BatchNorm2d-70           [-1, 16, 56, 56]              32
        ConvBlock-71           [-1, 16, 56, 56]               0
      BatchNorm2d-72          [-1, 128, 56, 56]             256
   InceptionBlock-73          [-1, 128, 56, 56]               0
AdaptiveAvgPool2d-74            [-1, 128, 1, 1]               0
           Conv1d-75               [-1, 1, 128]               3
      BatchNorm2d-76          [-1, 128, 56, 56]             256
              ECA-77          [-1, 128, 56, 56]               0
           Conv2d-78           [-1, 64, 56, 56]           8,256
      BatchNorm2d-79           [-1, 64, 56, 56]             128
        ConvBlock-80           [-1, 64, 56, 56]               0
           Conv2d-81           [-1, 32, 56, 56]           4,128
      BatchNorm2d-82           [-1, 32, 56, 56]              64
        ConvBlock-83           [-1, 32, 56, 56]               0
           Conv2d-84           [-1, 32, 56, 56]           9,248
      BatchNorm2d-85           [-1, 32, 56, 56]              64
        ConvBlock-86           [-1, 32, 56, 56]               0
           Conv2d-87           [-1, 16, 56, 56]           2,064
      BatchNorm2d-88           [-1, 16, 56, 56]              32
        ConvBlock-89           [-1, 16, 56, 56]               0
           Conv2d-90           [-1, 16, 56, 56]           6,416
      BatchNorm2d-91           [-1, 16, 56, 56]              32
        ConvBlock-92           [-1, 16, 56, 56]               0
        MaxPool2d-93          [-1, 128, 56, 56]               0
           Conv2d-94           [-1, 16, 56, 56]           2,064
      BatchNorm2d-95           [-1, 16, 56, 56]              32
        ConvBlock-96           [-1, 16, 56, 56]               0
      BatchNorm2d-97          [-1, 128, 56, 56]             256
   InceptionBlock-98          [-1, 128, 56, 56]               0
           Conv2d-99           [-1, 64, 56, 56]           8,256
     BatchNorm2d-100           [-1, 64, 56, 56]             128
       ConvBlock-101           [-1, 64, 56, 56]               0
          Conv2d-102           [-1, 32, 56, 56]           4,128
     BatchNorm2d-103           [-1, 32, 56, 56]              64
       ConvBlock-104           [-1, 32, 56, 56]               0
          Conv2d-105           [-1, 32, 56, 56]           9,248
     BatchNorm2d-106           [-1, 32, 56, 56]              64
       ConvBlock-107           [-1, 32, 56, 56]               0
          Conv2d-108           [-1, 16, 56, 56]           2,064
     BatchNorm2d-109           [-1, 16, 56, 56]              32
       ConvBlock-110           [-1, 16, 56, 56]               0
          Conv2d-111           [-1, 16, 56, 56]           6,416
     BatchNorm2d-112           [-1, 16, 56, 56]              32
       ConvBlock-113           [-1, 16, 56, 56]               0
       MaxPool2d-114          [-1, 128, 56, 56]               0
          Conv2d-115           [-1, 16, 56, 56]           2,064
     BatchNorm2d-116           [-1, 16, 56, 56]              32
       ConvBlock-117           [-1, 16, 56, 56]               0
     BatchNorm2d-118          [-1, 128, 56, 56]             256
  InceptionBlock-119          [-1, 128, 56, 56]               0
AdaptiveAvgPool2d-120            [-1, 128, 1, 1]               0
          Conv1d-121               [-1, 1, 128]               3
     BatchNorm2d-122          [-1, 128, 56, 56]             256
             ECA-123          [-1, 128, 56, 56]               0
 ConvTranspose2d-124         [-1, 64, 113, 113]         131,136
     BatchNorm2d-125         [-1, 64, 113, 113]             128
 ConvTranspose2d-126         [-1, 32, 225, 225]          32,800
     BatchNorm2d-127         [-1, 32, 225, 225]              64
 ConvTranspose2d-128         [-1, 32, 225, 225]          82,976
         Dropout-129         [-1, 32, 225, 225]               0
          Conv2d-130          [-1, 1, 224, 224]             129
         Dropout-131         [-1, 32, 225, 225]               0
          Conv2d-132          [-1, 1, 224, 224]             129
         Dropout-133         [-1, 32, 225, 225]               0
          Conv2d-134          [-1, 1, 224, 224]             129
         Dropout-135         [-1, 32, 225, 225]               0
          Conv2d-136          [-1, 1, 224, 224]             129
================================================================
Total params: 587,197
Trainable params: 587,197
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 270.88
Params size (MB): 2.24
Estimated Total Size (MB): 273.88
----------------------------------------------------------------
