----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 300, 300]          10,400
       BatchNorm2d-2         [-1, 32, 300, 300]              64
            Conv2d-3         [-1, 64, 150, 150]          32,832
       BatchNorm2d-4         [-1, 64, 150, 150]             128
            Conv2d-5          [-1, 128, 75, 75]         131,200
       BatchNorm2d-6          [-1, 128, 75, 75]             256
            Conv2d-7           [-1, 64, 75, 75]           8,256
       BatchNorm2d-8           [-1, 64, 75, 75]             128
         ConvBlock-9           [-1, 64, 75, 75]               0
           Conv2d-10           [-1, 32, 75, 75]           4,128
      BatchNorm2d-11           [-1, 32, 75, 75]              64
        ConvBlock-12           [-1, 32, 75, 75]               0
           Conv2d-13           [-1, 32, 75, 75]           9,248
      BatchNorm2d-14           [-1, 32, 75, 75]              64
        ConvBlock-15           [-1, 32, 75, 75]               0
           Conv2d-16           [-1, 16, 75, 75]           2,064
      BatchNorm2d-17           [-1, 16, 75, 75]              32
        ConvBlock-18           [-1, 16, 75, 75]               0
           Conv2d-19           [-1, 16, 75, 75]           6,416
      BatchNorm2d-20           [-1, 16, 75, 75]              32
        ConvBlock-21           [-1, 16, 75, 75]               0
        MaxPool2d-22          [-1, 128, 75, 75]               0
           Conv2d-23           [-1, 16, 75, 75]           2,064
      BatchNorm2d-24           [-1, 16, 75, 75]              32
        ConvBlock-25           [-1, 16, 75, 75]               0
      BatchNorm2d-26          [-1, 128, 75, 75]             256
   InceptionBlock-27          [-1, 128, 75, 75]               0
           Conv2d-28           [-1, 64, 75, 75]           8,256
      BatchNorm2d-29           [-1, 64, 75, 75]             128
        ConvBlock-30           [-1, 64, 75, 75]               0
           Conv2d-31           [-1, 32, 75, 75]           4,128
      BatchNorm2d-32           [-1, 32, 75, 75]              64
        ConvBlock-33           [-1, 32, 75, 75]               0
           Conv2d-34           [-1, 32, 75, 75]           9,248
      BatchNorm2d-35           [-1, 32, 75, 75]              64
        ConvBlock-36           [-1, 32, 75, 75]               0
           Conv2d-37           [-1, 16, 75, 75]           2,064
      BatchNorm2d-38           [-1, 16, 75, 75]              32
        ConvBlock-39           [-1, 16, 75, 75]               0
           Conv2d-40           [-1, 16, 75, 75]           6,416
      BatchNorm2d-41           [-1, 16, 75, 75]              32
        ConvBlock-42           [-1, 16, 75, 75]               0
        MaxPool2d-43          [-1, 128, 75, 75]               0
           Conv2d-44           [-1, 16, 75, 75]           2,064
      BatchNorm2d-45           [-1, 16, 75, 75]              32
        ConvBlock-46           [-1, 16, 75, 75]               0
      BatchNorm2d-47          [-1, 128, 75, 75]             256
   InceptionBlock-48          [-1, 128, 75, 75]               0
           Conv2d-49           [-1, 64, 75, 75]           8,256
      BatchNorm2d-50           [-1, 64, 75, 75]             128
        ConvBlock-51           [-1, 64, 75, 75]               0
           Conv2d-52           [-1, 32, 75, 75]           4,128
      BatchNorm2d-53           [-1, 32, 75, 75]              64
        ConvBlock-54           [-1, 32, 75, 75]               0
           Conv2d-55           [-1, 32, 75, 75]           9,248
      BatchNorm2d-56           [-1, 32, 75, 75]              64
        ConvBlock-57           [-1, 32, 75, 75]               0
           Conv2d-58           [-1, 16, 75, 75]           2,064
      BatchNorm2d-59           [-1, 16, 75, 75]              32
        ConvBlock-60           [-1, 16, 75, 75]               0
           Conv2d-61           [-1, 16, 75, 75]           6,416
      BatchNorm2d-62           [-1, 16, 75, 75]              32
        ConvBlock-63           [-1, 16, 75, 75]               0
        MaxPool2d-64          [-1, 128, 75, 75]               0
           Conv2d-65           [-1, 16, 75, 75]           2,064
      BatchNorm2d-66           [-1, 16, 75, 75]              32
        ConvBlock-67           [-1, 16, 75, 75]               0
      BatchNorm2d-68          [-1, 128, 75, 75]             256
   InceptionBlock-69          [-1, 128, 75, 75]               0
AdaptiveAvgPool2d-70            [-1, 128, 1, 1]               0
           Conv1d-71               [-1, 1, 128]               3
      BatchNorm2d-72          [-1, 128, 75, 75]             256
              ECA-73          [-1, 128, 75, 75]               0
           Conv2d-74           [-1, 64, 75, 75]           8,256
      BatchNorm2d-75           [-1, 64, 75, 75]             128
        ConvBlock-76           [-1, 64, 75, 75]               0
           Conv2d-77           [-1, 32, 75, 75]           4,128
      BatchNorm2d-78           [-1, 32, 75, 75]              64
        ConvBlock-79           [-1, 32, 75, 75]               0
           Conv2d-80           [-1, 32, 75, 75]           9,248
      BatchNorm2d-81           [-1, 32, 75, 75]              64
        ConvBlock-82           [-1, 32, 75, 75]               0
           Conv2d-83           [-1, 16, 75, 75]           2,064
      BatchNorm2d-84           [-1, 16, 75, 75]              32
        ConvBlock-85           [-1, 16, 75, 75]               0
           Conv2d-86           [-1, 16, 75, 75]           6,416
      BatchNorm2d-87           [-1, 16, 75, 75]              32
        ConvBlock-88           [-1, 16, 75, 75]               0
        MaxPool2d-89          [-1, 128, 75, 75]               0
           Conv2d-90           [-1, 16, 75, 75]           2,064
      BatchNorm2d-91           [-1, 16, 75, 75]              32
        ConvBlock-92           [-1, 16, 75, 75]               0
      BatchNorm2d-93          [-1, 128, 75, 75]             256
   InceptionBlock-94          [-1, 128, 75, 75]               0
           Conv2d-95           [-1, 64, 75, 75]           8,256
      BatchNorm2d-96           [-1, 64, 75, 75]             128
        ConvBlock-97           [-1, 64, 75, 75]               0
           Conv2d-98           [-1, 32, 75, 75]           4,128
      BatchNorm2d-99           [-1, 32, 75, 75]              64
       ConvBlock-100           [-1, 32, 75, 75]               0
          Conv2d-101           [-1, 32, 75, 75]           9,248
     BatchNorm2d-102           [-1, 32, 75, 75]              64
       ConvBlock-103           [-1, 32, 75, 75]               0
          Conv2d-104           [-1, 16, 75, 75]           2,064
     BatchNorm2d-105           [-1, 16, 75, 75]              32
       ConvBlock-106           [-1, 16, 75, 75]               0
          Conv2d-107           [-1, 16, 75, 75]           6,416
     BatchNorm2d-108           [-1, 16, 75, 75]              32
       ConvBlock-109           [-1, 16, 75, 75]               0
       MaxPool2d-110          [-1, 128, 75, 75]               0
          Conv2d-111           [-1, 16, 75, 75]           2,064
     BatchNorm2d-112           [-1, 16, 75, 75]              32
       ConvBlock-113           [-1, 16, 75, 75]               0
     BatchNorm2d-114          [-1, 128, 75, 75]             256
  InceptionBlock-115          [-1, 128, 75, 75]               0
 ConvTranspose2d-116         [-1, 64, 151, 151]         262,208
     BatchNorm2d-117         [-1, 64, 151, 151]             128
 ConvTranspose2d-118         [-1, 32, 301, 301]          32,800
     BatchNorm2d-119         [-1, 32, 301, 301]              64
 ConvTranspose2d-120         [-1, 32, 301, 301]          82,976
          Conv2d-121          [-1, 1, 300, 300]             129
          Conv2d-122          [-1, 1, 300, 300]             129
          Conv2d-123          [-1, 1, 300, 300]             129
          Conv2d-124          [-1, 1, 300, 300]             129
================================================================
Total params: 717,751
Trainable params: 717,751
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.37
Forward/backward pass size (MB): 374.96
Params size (MB): 2.74
Estimated Total Size (MB): 379.07
----------------------------------------------------------------
