----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7           [-1, 64, 56, 56]           8,256
       BatchNorm2d-8           [-1, 64, 56, 56]             128
         ConvBlock-9           [-1, 64, 56, 56]               0
           Conv2d-10           [-1, 32, 56, 56]           4,128
      BatchNorm2d-11           [-1, 32, 56, 56]              64
        ConvBlock-12           [-1, 32, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           9,248
      BatchNorm2d-14           [-1, 32, 56, 56]              64
        ConvBlock-15           [-1, 32, 56, 56]               0
           Conv2d-16           [-1, 16, 56, 56]           2,064
      BatchNorm2d-17           [-1, 16, 56, 56]              32
        ConvBlock-18           [-1, 16, 56, 56]               0
           Conv2d-19           [-1, 16, 56, 56]           6,416
      BatchNorm2d-20           [-1, 16, 56, 56]              32
        ConvBlock-21           [-1, 16, 56, 56]               0
        MaxPool2d-22          [-1, 128, 56, 56]               0
           Conv2d-23           [-1, 16, 56, 56]           2,064
      BatchNorm2d-24           [-1, 16, 56, 56]              32
        ConvBlock-25           [-1, 16, 56, 56]               0
      BatchNorm2d-26          [-1, 128, 56, 56]             256
   InceptionBlock-27          [-1, 128, 56, 56]               0
           Conv2d-28           [-1, 64, 56, 56]           8,256
      BatchNorm2d-29           [-1, 64, 56, 56]             128
        ConvBlock-30           [-1, 64, 56, 56]               0
           Conv2d-31           [-1, 32, 56, 56]           4,128
      BatchNorm2d-32           [-1, 32, 56, 56]              64
        ConvBlock-33           [-1, 32, 56, 56]               0
           Conv2d-34           [-1, 32, 56, 56]           9,248
      BatchNorm2d-35           [-1, 32, 56, 56]              64
        ConvBlock-36           [-1, 32, 56, 56]               0
           Conv2d-37           [-1, 16, 56, 56]           2,064
      BatchNorm2d-38           [-1, 16, 56, 56]              32
        ConvBlock-39           [-1, 16, 56, 56]               0
           Conv2d-40           [-1, 16, 56, 56]           6,416
      BatchNorm2d-41           [-1, 16, 56, 56]              32
        ConvBlock-42           [-1, 16, 56, 56]               0
        MaxPool2d-43          [-1, 128, 56, 56]               0
           Conv2d-44           [-1, 16, 56, 56]           2,064
      BatchNorm2d-45           [-1, 16, 56, 56]              32
        ConvBlock-46           [-1, 16, 56, 56]               0
      BatchNorm2d-47          [-1, 128, 56, 56]             256
   InceptionBlock-48          [-1, 128, 56, 56]               0
           Conv2d-49           [-1, 64, 56, 56]           8,256
      BatchNorm2d-50           [-1, 64, 56, 56]             128
        ConvBlock-51           [-1, 64, 56, 56]               0
           Conv2d-52           [-1, 32, 56, 56]           4,128
      BatchNorm2d-53           [-1, 32, 56, 56]              64
        ConvBlock-54           [-1, 32, 56, 56]               0
           Conv2d-55           [-1, 32, 56, 56]           9,248
      BatchNorm2d-56           [-1, 32, 56, 56]              64
        ConvBlock-57           [-1, 32, 56, 56]               0
           Conv2d-58           [-1, 16, 56, 56]           2,064
      BatchNorm2d-59           [-1, 16, 56, 56]              32
        ConvBlock-60           [-1, 16, 56, 56]               0
           Conv2d-61           [-1, 16, 56, 56]           6,416
      BatchNorm2d-62           [-1, 16, 56, 56]              32
        ConvBlock-63           [-1, 16, 56, 56]               0
        MaxPool2d-64          [-1, 128, 56, 56]               0
           Conv2d-65           [-1, 16, 56, 56]           2,064
      BatchNorm2d-66           [-1, 16, 56, 56]              32
        ConvBlock-67           [-1, 16, 56, 56]               0
      BatchNorm2d-68          [-1, 128, 56, 56]             256
   InceptionBlock-69          [-1, 128, 56, 56]               0
AdaptiveMaxPool2d-70            [-1, 128, 1, 1]               0
AdaptiveAvgPool2d-71            [-1, 128, 1, 1]               0
           Conv2d-72             [-1, 64, 1, 1]           8,192
             ReLU-73             [-1, 64, 1, 1]               0
           Conv2d-74            [-1, 128, 1, 1]           8,192
           Conv2d-75             [-1, 64, 1, 1]           8,192
             ReLU-76             [-1, 64, 1, 1]               0
           Conv2d-77            [-1, 128, 1, 1]           8,192
          Sigmoid-78            [-1, 128, 1, 1]               0
 ChannelAttention-79            [-1, 128, 1, 1]               0
           Conv2d-80            [-1, 1, 56, 56]              99
          Sigmoid-81            [-1, 1, 56, 56]               0
 SpatialAttention-82            [-1, 1, 56, 56]               0
        CBAMBlock-83          [-1, 128, 56, 56]               0
           Conv2d-84           [-1, 64, 56, 56]           8,256
      BatchNorm2d-85           [-1, 64, 56, 56]             128
        ConvBlock-86           [-1, 64, 56, 56]               0
           Conv2d-87           [-1, 32, 56, 56]           4,128
      BatchNorm2d-88           [-1, 32, 56, 56]              64
        ConvBlock-89           [-1, 32, 56, 56]               0
           Conv2d-90           [-1, 32, 56, 56]           9,248
      BatchNorm2d-91           [-1, 32, 56, 56]              64
        ConvBlock-92           [-1, 32, 56, 56]               0
           Conv2d-93           [-1, 16, 56, 56]           2,064
      BatchNorm2d-94           [-1, 16, 56, 56]              32
        ConvBlock-95           [-1, 16, 56, 56]               0
           Conv2d-96           [-1, 16, 56, 56]           6,416
      BatchNorm2d-97           [-1, 16, 56, 56]              32
        ConvBlock-98           [-1, 16, 56, 56]               0
        MaxPool2d-99          [-1, 128, 56, 56]               0
          Conv2d-100           [-1, 16, 56, 56]           2,064
     BatchNorm2d-101           [-1, 16, 56, 56]              32
       ConvBlock-102           [-1, 16, 56, 56]               0
     BatchNorm2d-103          [-1, 128, 56, 56]             256
  InceptionBlock-104          [-1, 128, 56, 56]               0
          Conv2d-105           [-1, 64, 56, 56]           8,256
     BatchNorm2d-106           [-1, 64, 56, 56]             128
       ConvBlock-107           [-1, 64, 56, 56]               0
          Conv2d-108           [-1, 32, 56, 56]           4,128
     BatchNorm2d-109           [-1, 32, 56, 56]              64
       ConvBlock-110           [-1, 32, 56, 56]               0
          Conv2d-111           [-1, 32, 56, 56]           9,248
     BatchNorm2d-112           [-1, 32, 56, 56]              64
       ConvBlock-113           [-1, 32, 56, 56]               0
          Conv2d-114           [-1, 16, 56, 56]           2,064
     BatchNorm2d-115           [-1, 16, 56, 56]              32
       ConvBlock-116           [-1, 16, 56, 56]               0
          Conv2d-117           [-1, 16, 56, 56]           6,416
     BatchNorm2d-118           [-1, 16, 56, 56]              32
       ConvBlock-119           [-1, 16, 56, 56]               0
       MaxPool2d-120          [-1, 128, 56, 56]               0
          Conv2d-121           [-1, 16, 56, 56]           2,064
     BatchNorm2d-122           [-1, 16, 56, 56]              32
       ConvBlock-123           [-1, 16, 56, 56]               0
     BatchNorm2d-124          [-1, 128, 56, 56]             256
  InceptionBlock-125          [-1, 128, 56, 56]               0
 ConvTranspose2d-126         [-1, 64, 113, 113]         131,136
     BatchNorm2d-127         [-1, 64, 113, 113]             128
 ConvTranspose2d-128         [-1, 32, 225, 225]          32,800
     BatchNorm2d-129         [-1, 32, 225, 225]              64
 ConvTranspose2d-130         [-1, 32, 225, 225]          82,976
         Dropout-131         [-1, 32, 225, 225]               0
          Conv2d-132          [-1, 1, 224, 224]             129
         Dropout-133         [-1, 32, 225, 225]               0
          Conv2d-134          [-1, 1, 224, 224]             129
         Dropout-135         [-1, 32, 225, 225]               0
          Conv2d-136          [-1, 1, 224, 224]             129
         Dropout-137         [-1, 32, 225, 225]               0
          Conv2d-138          [-1, 1, 224, 224]             129
================================================================
Total params: 619,287
Trainable params: 619,287
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 255.64
Params size (MB): 2.36
Estimated Total Size (MB): 258.76
----------------------------------------------------------------
