----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7          [-1, 128, 56, 56]         147,584
       BatchNorm2d-8          [-1, 128, 56, 56]             256
            Conv2d-9          [-1, 128, 56, 56]         147,584
      BatchNorm2d-10          [-1, 128, 56, 56]             256
    ResidualBlock-11          [-1, 128, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]           8,256
      BatchNorm2d-13           [-1, 64, 56, 56]             128
        ConvBlock-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           4,128
      BatchNorm2d-16           [-1, 32, 56, 56]              64
        ConvBlock-17           [-1, 32, 56, 56]               0
           Conv2d-18           [-1, 32, 56, 56]           9,248
      BatchNorm2d-19           [-1, 32, 56, 56]              64
        ConvBlock-20           [-1, 32, 56, 56]               0
           Conv2d-21           [-1, 16, 56, 56]           2,064
      BatchNorm2d-22           [-1, 16, 56, 56]              32
        ConvBlock-23           [-1, 16, 56, 56]               0
           Conv2d-24           [-1, 16, 56, 56]           6,416
      BatchNorm2d-25           [-1, 16, 56, 56]              32
        ConvBlock-26           [-1, 16, 56, 56]               0
        MaxPool2d-27          [-1, 128, 56, 56]               0
           Conv2d-28           [-1, 16, 56, 56]           2,064
      BatchNorm2d-29           [-1, 16, 56, 56]              32
        ConvBlock-30           [-1, 16, 56, 56]               0
   InceptionBlock-31          [-1, 128, 56, 56]               0
           Conv2d-32          [-1, 128, 56, 56]         147,584
      BatchNorm2d-33          [-1, 128, 56, 56]             256
           Conv2d-34          [-1, 128, 56, 56]         147,584
      BatchNorm2d-35          [-1, 128, 56, 56]             256
    ResidualBlock-36          [-1, 128, 56, 56]               0
           Conv2d-37           [-1, 64, 56, 56]           8,256
      BatchNorm2d-38           [-1, 64, 56, 56]             128
        ConvBlock-39           [-1, 64, 56, 56]               0
           Conv2d-40           [-1, 32, 56, 56]           4,128
      BatchNorm2d-41           [-1, 32, 56, 56]              64
        ConvBlock-42           [-1, 32, 56, 56]               0
           Conv2d-43           [-1, 32, 56, 56]           9,248
      BatchNorm2d-44           [-1, 32, 56, 56]              64
        ConvBlock-45           [-1, 32, 56, 56]               0
           Conv2d-46           [-1, 16, 56, 56]           2,064
      BatchNorm2d-47           [-1, 16, 56, 56]              32
        ConvBlock-48           [-1, 16, 56, 56]               0
           Conv2d-49           [-1, 16, 56, 56]           6,416
      BatchNorm2d-50           [-1, 16, 56, 56]              32
        ConvBlock-51           [-1, 16, 56, 56]               0
        MaxPool2d-52          [-1, 128, 56, 56]               0
           Conv2d-53           [-1, 16, 56, 56]           2,064
      BatchNorm2d-54           [-1, 16, 56, 56]              32
        ConvBlock-55           [-1, 16, 56, 56]               0
   InceptionBlock-56          [-1, 128, 56, 56]               0
           Conv2d-57          [-1, 128, 56, 56]         147,584
      BatchNorm2d-58          [-1, 128, 56, 56]             256
           Conv2d-59          [-1, 128, 56, 56]         147,584
      BatchNorm2d-60          [-1, 128, 56, 56]             256
    ResidualBlock-61          [-1, 128, 56, 56]               0
  ConvTranspose2d-62         [-1, 64, 113, 113]         131,136
      BatchNorm2d-63         [-1, 64, 113, 113]             128
  ConvTranspose2d-64         [-1, 32, 225, 225]          32,800
      BatchNorm2d-65         [-1, 32, 225, 225]              64
  ConvTranspose2d-66         [-1, 32, 225, 225]          82,976
          Dropout-67         [-1, 32, 225, 225]               0
           Conv2d-68          [-1, 1, 224, 224]             129
          Dropout-69         [-1, 32, 225, 225]               0
           Conv2d-70          [-1, 1, 224, 224]             129
          Dropout-71         [-1, 32, 225, 225]               0
           Conv2d-72          [-1, 1, 224, 224]             129
          Dropout-73         [-1, 32, 225, 225]               0
           Conv2d-74          [-1, 1, 224, 224]             129
================================================================
Total params: 1,374,596
Trainable params: 1,374,596
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 226.85
Params size (MB): 5.24
Estimated Total Size (MB): 232.86
----------------------------------------------------------------
