----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7           [-1, 64, 56, 56]           8,256
       BatchNorm2d-8           [-1, 64, 56, 56]             128
         ConvBlock-9           [-1, 64, 56, 56]               0
           Conv2d-10           [-1, 32, 56, 56]           4,128
      BatchNorm2d-11           [-1, 32, 56, 56]              64
        ConvBlock-12           [-1, 32, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           9,248
      BatchNorm2d-14           [-1, 32, 56, 56]              64
        ConvBlock-15           [-1, 32, 56, 56]               0
           Conv2d-16           [-1, 16, 56, 56]           2,064
      BatchNorm2d-17           [-1, 16, 56, 56]              32
        ConvBlock-18           [-1, 16, 56, 56]               0
           Conv2d-19           [-1, 16, 56, 56]           6,416
      BatchNorm2d-20           [-1, 16, 56, 56]              32
        ConvBlock-21           [-1, 16, 56, 56]               0
        MaxPool2d-22          [-1, 128, 56, 56]               0
           Conv2d-23           [-1, 16, 56, 56]           2,064
      BatchNorm2d-24           [-1, 16, 56, 56]              32
        ConvBlock-25           [-1, 16, 56, 56]               0
      BatchNorm2d-26          [-1, 128, 56, 56]             256
   InceptionBlock-27          [-1, 128, 56, 56]               0
           Conv2d-28           [-1, 64, 56, 56]           8,256
      BatchNorm2d-29           [-1, 64, 56, 56]             128
        ConvBlock-30           [-1, 64, 56, 56]               0
           Conv2d-31           [-1, 32, 56, 56]           4,128
      BatchNorm2d-32           [-1, 32, 56, 56]              64
        ConvBlock-33           [-1, 32, 56, 56]               0
           Conv2d-34           [-1, 32, 56, 56]           9,248
      BatchNorm2d-35           [-1, 32, 56, 56]              64
        ConvBlock-36           [-1, 32, 56, 56]               0
           Conv2d-37           [-1, 16, 56, 56]           2,064
      BatchNorm2d-38           [-1, 16, 56, 56]              32
        ConvBlock-39           [-1, 16, 56, 56]               0
           Conv2d-40           [-1, 16, 56, 56]           6,416
      BatchNorm2d-41           [-1, 16, 56, 56]              32
        ConvBlock-42           [-1, 16, 56, 56]               0
        MaxPool2d-43          [-1, 128, 56, 56]               0
           Conv2d-44           [-1, 16, 56, 56]           2,064
      BatchNorm2d-45           [-1, 16, 56, 56]              32
        ConvBlock-46           [-1, 16, 56, 56]               0
      BatchNorm2d-47          [-1, 128, 56, 56]             256
   InceptionBlock-48          [-1, 128, 56, 56]               0
           Conv2d-49           [-1, 64, 56, 56]           8,256
      BatchNorm2d-50           [-1, 64, 56, 56]             128
        ConvBlock-51           [-1, 64, 56, 56]               0
           Conv2d-52           [-1, 32, 56, 56]           4,128
      BatchNorm2d-53           [-1, 32, 56, 56]              64
        ConvBlock-54           [-1, 32, 56, 56]               0
           Conv2d-55           [-1, 32, 56, 56]           9,248
      BatchNorm2d-56           [-1, 32, 56, 56]              64
        ConvBlock-57           [-1, 32, 56, 56]               0
           Conv2d-58           [-1, 16, 56, 56]           2,064
      BatchNorm2d-59           [-1, 16, 56, 56]              32
        ConvBlock-60           [-1, 16, 56, 56]               0
           Conv2d-61           [-1, 16, 56, 56]           6,416
      BatchNorm2d-62           [-1, 16, 56, 56]              32
        ConvBlock-63           [-1, 16, 56, 56]               0
        MaxPool2d-64          [-1, 128, 56, 56]               0
           Conv2d-65           [-1, 16, 56, 56]           2,064
      BatchNorm2d-66           [-1, 16, 56, 56]              32
        ConvBlock-67           [-1, 16, 56, 56]               0
      BatchNorm2d-68          [-1, 128, 56, 56]             256
   InceptionBlock-69          [-1, 128, 56, 56]               0
           Conv2d-70           [-1, 64, 56, 56]           8,256
      BatchNorm2d-71           [-1, 64, 56, 56]             128
        ConvBlock-72           [-1, 64, 56, 56]               0
           Conv2d-73           [-1, 32, 56, 56]           4,128
      BatchNorm2d-74           [-1, 32, 56, 56]              64
        ConvBlock-75           [-1, 32, 56, 56]               0
           Conv2d-76           [-1, 32, 56, 56]           9,248
      BatchNorm2d-77           [-1, 32, 56, 56]              64
        ConvBlock-78           [-1, 32, 56, 56]               0
           Conv2d-79           [-1, 16, 56, 56]           2,064
      BatchNorm2d-80           [-1, 16, 56, 56]              32
        ConvBlock-81           [-1, 16, 56, 56]               0
           Conv2d-82           [-1, 16, 56, 56]           6,416
      BatchNorm2d-83           [-1, 16, 56, 56]              32
        ConvBlock-84           [-1, 16, 56, 56]               0
        MaxPool2d-85          [-1, 128, 56, 56]               0
           Conv2d-86           [-1, 16, 56, 56]           2,064
      BatchNorm2d-87           [-1, 16, 56, 56]              32
        ConvBlock-88           [-1, 16, 56, 56]               0
      BatchNorm2d-89          [-1, 128, 56, 56]             256
   InceptionBlock-90          [-1, 128, 56, 56]               0
           Conv2d-91           [-1, 64, 56, 56]           8,256
      BatchNorm2d-92           [-1, 64, 56, 56]             128
        ConvBlock-93           [-1, 64, 56, 56]               0
           Conv2d-94           [-1, 32, 56, 56]           4,128
      BatchNorm2d-95           [-1, 32, 56, 56]              64
        ConvBlock-96           [-1, 32, 56, 56]               0
           Conv2d-97           [-1, 32, 56, 56]           9,248
      BatchNorm2d-98           [-1, 32, 56, 56]              64
        ConvBlock-99           [-1, 32, 56, 56]               0
          Conv2d-100           [-1, 16, 56, 56]           2,064
     BatchNorm2d-101           [-1, 16, 56, 56]              32
       ConvBlock-102           [-1, 16, 56, 56]               0
          Conv2d-103           [-1, 16, 56, 56]           6,416
     BatchNorm2d-104           [-1, 16, 56, 56]              32
       ConvBlock-105           [-1, 16, 56, 56]               0
       MaxPool2d-106          [-1, 128, 56, 56]               0
          Conv2d-107           [-1, 16, 56, 56]           2,064
     BatchNorm2d-108           [-1, 16, 56, 56]              32
       ConvBlock-109           [-1, 16, 56, 56]               0
     BatchNorm2d-110          [-1, 128, 56, 56]             256
  InceptionBlock-111          [-1, 128, 56, 56]               0
 ConvTranspose2d-112         [-1, 64, 113, 113]         262,208
     BatchNorm2d-113         [-1, 64, 113, 113]             128
 ConvTranspose2d-114         [-1, 32, 225, 225]          32,800
     BatchNorm2d-115         [-1, 32, 225, 225]              64
 ConvTranspose2d-116         [-1, 32, 225, 225]          82,976
         Dropout-117         [-1, 32, 225, 225]               0
          Conv2d-118          [-1, 1, 224, 224]             129
         Dropout-119         [-1, 32, 225, 225]               0
          Conv2d-120          [-1, 1, 224, 224]             129
         Dropout-121         [-1, 32, 225, 225]               0
          Conv2d-122          [-1, 1, 224, 224]             129
         Dropout-123         [-1, 32, 225, 225]               0
          Conv2d-124          [-1, 1, 224, 224]             129
================================================================
Total params: 717,492
Trainable params: 717,492
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 252.49
Params size (MB): 2.74
Estimated Total Size (MB): 256.00
----------------------------------------------------------------
