----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7           [-1, 64, 56, 56]           8,256
       BatchNorm2d-8           [-1, 64, 56, 56]             128
         ConvBlock-9           [-1, 64, 56, 56]               0
           Conv2d-10           [-1, 32, 56, 56]           4,128
      BatchNorm2d-11           [-1, 32, 56, 56]              64
        ConvBlock-12           [-1, 32, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           9,248
      BatchNorm2d-14           [-1, 32, 56, 56]              64
        ConvBlock-15           [-1, 32, 56, 56]               0
           Conv2d-16           [-1, 16, 56, 56]           2,064
      BatchNorm2d-17           [-1, 16, 56, 56]              32
        ConvBlock-18           [-1, 16, 56, 56]               0
           Conv2d-19           [-1, 16, 56, 56]           6,416
      BatchNorm2d-20           [-1, 16, 56, 56]              32
        ConvBlock-21           [-1, 16, 56, 56]               0
        MaxPool2d-22          [-1, 128, 56, 56]               0
           Conv2d-23           [-1, 16, 56, 56]           2,064
      BatchNorm2d-24           [-1, 16, 56, 56]              32
        ConvBlock-25           [-1, 16, 56, 56]               0
   InceptionBlock-26          [-1, 128, 56, 56]               0
           Conv2d-27           [-1, 64, 56, 56]           8,256
      BatchNorm2d-28           [-1, 64, 56, 56]             128
        ConvBlock-29           [-1, 64, 56, 56]               0
           Conv2d-30           [-1, 32, 56, 56]           4,128
      BatchNorm2d-31           [-1, 32, 56, 56]              64
        ConvBlock-32           [-1, 32, 56, 56]               0
           Conv2d-33           [-1, 32, 56, 56]           9,248
      BatchNorm2d-34           [-1, 32, 56, 56]              64
        ConvBlock-35           [-1, 32, 56, 56]               0
           Conv2d-36           [-1, 16, 56, 56]           2,064
      BatchNorm2d-37           [-1, 16, 56, 56]              32
        ConvBlock-38           [-1, 16, 56, 56]               0
           Conv2d-39           [-1, 16, 56, 56]           6,416
      BatchNorm2d-40           [-1, 16, 56, 56]              32
        ConvBlock-41           [-1, 16, 56, 56]               0
        MaxPool2d-42          [-1, 128, 56, 56]               0
           Conv2d-43           [-1, 16, 56, 56]           2,064
      BatchNorm2d-44           [-1, 16, 56, 56]              32
        ConvBlock-45           [-1, 16, 56, 56]               0
   InceptionBlock-46          [-1, 128, 56, 56]               0
           Conv2d-47           [-1, 64, 56, 56]           8,256
      BatchNorm2d-48           [-1, 64, 56, 56]             128
        ConvBlock-49           [-1, 64, 56, 56]               0
           Conv2d-50           [-1, 32, 56, 56]           4,128
      BatchNorm2d-51           [-1, 32, 56, 56]              64
        ConvBlock-52           [-1, 32, 56, 56]               0
           Conv2d-53           [-1, 32, 56, 56]           9,248
      BatchNorm2d-54           [-1, 32, 56, 56]              64
        ConvBlock-55           [-1, 32, 56, 56]               0
           Conv2d-56           [-1, 16, 56, 56]           2,064
      BatchNorm2d-57           [-1, 16, 56, 56]              32
        ConvBlock-58           [-1, 16, 56, 56]               0
           Conv2d-59           [-1, 16, 56, 56]           6,416
      BatchNorm2d-60           [-1, 16, 56, 56]              32
        ConvBlock-61           [-1, 16, 56, 56]               0
        MaxPool2d-62          [-1, 128, 56, 56]               0
           Conv2d-63           [-1, 16, 56, 56]           2,064
      BatchNorm2d-64           [-1, 16, 56, 56]              32
        ConvBlock-65           [-1, 16, 56, 56]               0
   InceptionBlock-66          [-1, 128, 56, 56]               0
           Conv2d-67           [-1, 64, 56, 56]           8,256
      BatchNorm2d-68           [-1, 64, 56, 56]             128
        ConvBlock-69           [-1, 64, 56, 56]               0
           Conv2d-70           [-1, 32, 56, 56]           4,128
      BatchNorm2d-71           [-1, 32, 56, 56]              64
        ConvBlock-72           [-1, 32, 56, 56]               0
           Conv2d-73           [-1, 32, 56, 56]           9,248
      BatchNorm2d-74           [-1, 32, 56, 56]              64
        ConvBlock-75           [-1, 32, 56, 56]               0
           Conv2d-76           [-1, 16, 56, 56]           2,064
      BatchNorm2d-77           [-1, 16, 56, 56]              32
        ConvBlock-78           [-1, 16, 56, 56]               0
           Conv2d-79           [-1, 16, 56, 56]           6,416
      BatchNorm2d-80           [-1, 16, 56, 56]              32
        ConvBlock-81           [-1, 16, 56, 56]               0
        MaxPool2d-82          [-1, 128, 56, 56]               0
           Conv2d-83           [-1, 16, 56, 56]           2,064
      BatchNorm2d-84           [-1, 16, 56, 56]              32
        ConvBlock-85           [-1, 16, 56, 56]               0
   InceptionBlock-86          [-1, 128, 56, 56]               0
           Conv2d-87           [-1, 64, 56, 56]           8,256
      BatchNorm2d-88           [-1, 64, 56, 56]             128
        ConvBlock-89           [-1, 64, 56, 56]               0
           Conv2d-90           [-1, 32, 56, 56]           4,128
      BatchNorm2d-91           [-1, 32, 56, 56]              64
        ConvBlock-92           [-1, 32, 56, 56]               0
           Conv2d-93           [-1, 32, 56, 56]           9,248
      BatchNorm2d-94           [-1, 32, 56, 56]              64
        ConvBlock-95           [-1, 32, 56, 56]               0
           Conv2d-96           [-1, 16, 56, 56]           2,064
      BatchNorm2d-97           [-1, 16, 56, 56]              32
        ConvBlock-98           [-1, 16, 56, 56]               0
           Conv2d-99           [-1, 16, 56, 56]           6,416
     BatchNorm2d-100           [-1, 16, 56, 56]              32
       ConvBlock-101           [-1, 16, 56, 56]               0
       MaxPool2d-102          [-1, 128, 56, 56]               0
          Conv2d-103           [-1, 16, 56, 56]           2,064
     BatchNorm2d-104           [-1, 16, 56, 56]              32
       ConvBlock-105           [-1, 16, 56, 56]               0
  InceptionBlock-106          [-1, 128, 56, 56]               0
 ConvTranspose2d-107         [-1, 64, 113, 113]         131,136
     BatchNorm2d-108         [-1, 64, 113, 113]             128
 ConvTranspose2d-109         [-1, 32, 225, 225]          32,800
     BatchNorm2d-110         [-1, 32, 225, 225]              64
 ConvTranspose2d-111         [-1, 32, 225, 225]          82,976
         Dropout-112         [-1, 32, 225, 225]               0
          Conv2d-113          [-1, 1, 224, 224]             129
         Dropout-114         [-1, 32, 225, 225]               0
          Conv2d-115          [-1, 1, 224, 224]             129
         Dropout-116         [-1, 32, 225, 225]               0
          Conv2d-117          [-1, 1, 224, 224]             129
         Dropout-118         [-1, 32, 225, 225]               0
          Conv2d-119          [-1, 1, 224, 224]             129
================================================================
Total params: 585,140
Trainable params: 585,140
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 237.18
Params size (MB): 2.23
Estimated Total Size (MB): 240.18
----------------------------------------------------------------
